README.md
```mermaid
classDiagram
  class ComponenteElectronico {
        +String idComponente
        +String nombre
        +int cantidadStock
        +String ubicacionAlmacen
        +actualizarStock(int cantidad)
    }

    class ComponentePasivo {
        +String tolerancia
        +String valor
    }

    class ComponenteActivo {
        +String voltajeOperacion
        +String fabricante
    }

    class Proveedor {
        +String idProveedor
        +String nombre
        +realizarPedido(ComponenteElectronico, int)
    }

    class Pedido {
        +String idPedido
        +Date fecha
        +calcularCostoTotal() float
    }

    class Almacen {
        +Map String, List ComponenteElectronico
        +buscarComponente(String) ComponenteElectronico
    }

    ComponenteElectronico <|-- ComponentePasivo
    ComponenteElectronico <|-- ComponenteActivo

    Proveedor "suministra" --> "se pide en" Pedido
    Pedido "contiene" --> "es parte de" ComponenteElectronico
    Almacen "guarda" o-- "esta en" ComponenteElectronico

   Proveedor ..> ComponenteElectronico : <<usa>>
```
